In [348]:
# import library
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

# Importing the source data

In [349]:
suicide_file = 'master.csv'
df=pd.read_csv(suicide_file)

In [350]:
df.head()

,country,year,sex,age,suicides_no,population,suicides/100k pop,country-year,HDI for year,gdp_for_year ($),gdp_per_capita ($),generation
0,Albania,1987,male,15-24 years,21,312900,6.71,Albania1987,NaN,"2,156,624,900",796,Generation X
1,Albania,1987,male,35-54 years,16,308000,5.19,Albania1987,NaN,"2,156,624,900",796,Silent
2,Albania,1987,female,15-24 years,14,289700,4.83,Albania1987,NaN,"2,156,624,900",796,Generation X
3,Albania,1987,male,75+ years,1,21800,4.59,Albania1987,NaN,"2,156,624,900",796,G.I. Generation
4,Albania,1987,male,25-34 years,9,274300,3.28,Albania1987,NaN,"2,156,624,900",796,Boomers

In [351]:
df.dtypes

country                object
year                    int64
sex                    object
age                    object
suicides_no             int64
population              int64
suicides/100k pop     float64
country-year           object
HDI for year          float64
 gdp_for_year ($)      object
gdp_per_capita ($)      int64
generation             object
dtype: object

In [352]:
# Drop column country-year
df.drop(columns='country-year', inplace=True)
# Drop column HDI for year
df.drop(columns='HDI for year', inplace=True)
# Drop null values
df.dropna(how='any', inplace=True)
# Drop or filter the rows to only include years 2000 through 2015 (referenced https://stackoverflow.com/questions/13851535/how-to-delete-rows-from-a-pandas-dataframe-based-on-a-conditional-expression)
df.drop(df[(df.year < 2000) | (df.year > 2015)].index, inplace=True)
# rename fields to be more appropriate
df.rename(columns={'suicides/100k pop':'suicides_100k_pop',
                          ' gdp_for_year ($) ':'gdp_for_year',
                          'gdp_per_capita ($)':'gdp_per_capita'}, 
                 inplace=True)
# check the dataframe structure
df.head()

,country,year,sex,age,suicides_no,population,suicides_100k_pop,gdp_for_year,gdp_per_capita,generation
132,Albania,2000,male,25-34 years,17,232000,7.33,"3,632,043,908",1299,Generation X
133,Albania,2000,male,55-74 years,10,177400,5.64,"3,632,043,908",1299,Silent
134,Albania,2000,female,75+ years,2,37800,5.29,"3,632,043,908",1299,G.I. Generation
135,Albania,2000,male,75+ years,1,24900,4.02,"3,632,043,908",1299,G.I. Generation
136,Albania,2000,female,15-24 years,6,263900,2.27,"3,632,043,908",1299,Generation X

In [353]:
df.shape

(16008, 10)

In [354]:
df.isna()

,country,year,sex,age,suicides_no,population,suicides_100k_pop,gdp_for_year,gdp_per_capita,generation
132,False,False,False,False,False,False,False,False,False,False
133,False,False,False,False,False,False,False,False,False,False
134,False,False,False,False,False,False,False,False,False,False
135,False,False,False,False,False,False,False,False,False,False
136,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
27815,False,False,False,False,False,False,False,False,False,False
27816,False,False,False,False,False,False,False,False,False,False
27817,False,False,False,False,False,False,False,False,False,False
27818,False,False,False,False,False,False,False,False,False,False
27819,False,False,False,False,False,False,False,False,False,False

# write dataframe to a new csv

In [355]:
df.to_csv('suicide_clean.csv', index=False)

In [356]:
# creating a new table by copying the original dataframe
suicide_df=df.copy()
suicide_df

,country,year,sex,age,suicides_no,population,suicides_100k_pop,gdp_for_year,gdp_per_capita,generation
132,Albania,2000,male,25-34 years,17,232000,7.33,"3,632,043,908",1299,Generation X
133,Albania,2000,male,55-74 years,10,177400,5.64,"3,632,043,908",1299,Silent
134,Albania,2000,female,75+ years,2,37800,5.29,"3,632,043,908",1299,G.I. Generation
135,Albania,2000,male,75+ years,1,24900,4.02,"3,632,043,908",1299,G.I. Generation
136,Albania,2000,female,15-24 years,6,263900,2.27,"3,632,043,908",1299,Generation X
...,...,...,...,...,...,...,...,...,...,...
27815,Uzbekistan,2014,female,35-54 years,107,3620833,2.96,"63,067,077,179",2309,Generation X
27816,Uzbekistan,2014,female,75+ years,9,348465,2.58,"63,067,077,179",2309,Silent
27817,Uzbekistan,2014,male,5-14 years,60,2762158,2.17,"63,067,077,179",2309,Generation Z
27818,Uzbekistan,2014,female,5-14 years,44,2631600,1.67,"63,067,077,179",2309,Generation Z
27819,Uzbekistan,2014,female,55-74 years,21,1438935,1.46,"63,067,077,179",2309,Boomers

In [357]:
# checking column names and data types
suicide_df.dtypes

country               object
year                   int64
sex                   object
age                   object
suicides_no            int64
population             int64
suicides_100k_pop    float64
gdp_for_year          object
gdp_per_capita         int64
generation            object
dtype: object

In [358]:
# dropping all non-varying data
suicide_df.drop(columns='gdp_for_year'  , inplace=True)
suicide_df.drop(columns='gdp_per_capita', inplace=True)
suicide_df.drop(columns='population', inplace=True)
suicide_df

,country,year,sex,age,suicides_no,suicides_100k_pop,generation
132,Albania,2000,male,25-34 years,17,7.33,Generation X
133,Albania,2000,male,55-74 years,10,5.64,Silent
134,Albania,2000,female,75+ years,2,5.29,G.I. Generation
135,Albania,2000,male,75+ years,1,4.02,G.I. Generation
136,Albania,2000,female,15-24 years,6,2.27,Generation X
...,...,...,...,...,...,...,...
27815,Uzbekistan,2014,female,35-54 years,107,2.96,Generation X
27816,Uzbekistan,2014,female,75+ years,9,2.58,Silent
27817,Uzbekistan,2014,male,5-14 years,60,2.17,Generation Z
27818,Uzbekistan,2014,female,5-14 years,44,1.67,Generation Z
27819,Uzbekistan,2014,female,55-74 years,21,1.46,Boomers

In [359]:
suicide_df.to_csv('suicide_table.csv', index=False)

In [360]:
# creating a new table by copying the original dataframe
country_df=df.copy()
country_df

,country,year,sex,age,suicides_no,population,suicides_100k_pop,gdp_for_year,gdp_per_capita,generation
132,Albania,2000,male,25-34 years,17,232000,7.33,"3,632,043,908",1299,Generation X
133,Albania,2000,male,55-74 years,10,177400,5.64,"3,632,043,908",1299,Silent
134,Albania,2000,female,75+ years,2,37800,5.29,"3,632,043,908",1299,G.I. Generation
135,Albania,2000,male,75+ years,1,24900,4.02,"3,632,043,908",1299,G.I. Generation
136,Albania,2000,female,15-24 years,6,263900,2.27,"3,632,043,908",1299,Generation X
...,...,...,...,...,...,...,...,...,...,...
27815,Uzbekistan,2014,female,35-54 years,107,3620833,2.96,"63,067,077,179",2309,Generation X
27816,Uzbekistan,2014,female,75+ years,9,348465,2.58,"63,067,077,179",2309,Silent
27817,Uzbekistan,2014,male,5-14 years,60,2762158,2.17,"63,067,077,179",2309,Generation Z
27818,Uzbekistan,2014,female,5-14 years,44,2631600,1.67,"63,067,077,179",2309,Generation Z
27819,Uzbekistan,2014,female,55-74 years,21,1438935,1.46,"63,067,077,179",2309,Boomers

In [361]:
country_df.dtypes

country               object
year                   int64
sex                   object
age                   object
suicides_no            int64
population             int64
suicides_100k_pop    float64
gdp_for_year          object
gdp_per_capita         int64
generation            object
dtype: object

In [362]:
# dropping all varying data
country_df.drop(columns='sex', inplace=True)
country_df.drop(columns='age', inplace=True)
country_df.drop(columns='suicides_no', inplace=True)
country_df.drop(columns='suicides_100k_pop', inplace=True)
country_df.drop(columns='generation', inplace=True)
country_df

          country  year  population    gdp_for_year  gdp_per_capita
132       Albania  2000      232000   3,632,043,908            1299
133       Albania  2000      177400   3,632,043,908            1299
134       Albania  2000       37800   3,632,043,908            1299
135       Albania  2000       24900   3,632,043,908            1299
136       Albania  2000      263900   3,632,043,908            1299
...           ...   ...         ...             ...             ...
27815  Uzbekistan  2014     3620833  63,067,077,179            2309
27816  Uzbekistan  2014      348465  63,067,077,179            2309
27817  Uzbekistan  2014     2762158  63,067,077,179            2309
27818  Uzbekistan  2014     2631600  63,067,077,179            2309
27819  Uzbekistan  2014     1438935  63,067,077,179            2309

[16008 rows x 5 columns]

In [363]:
#sum the population data and group by year and country
country_df.groupby(['country','year', 'gdp_for_year','gdp_per_capita'])['population'].sum()

country     year  gdp_for_year    gdp_per_capita
Albania     2000  3,632,043,908   1299               2796300
            2001  4,060,758,804   1451               2799349
            2002  4,435,078,648   1573               2818839
            2003  5,746,945,913   2021               2843929
            2004  7,314,865,176   2544               2874991
                                                      ...
Uzbekistan  2010  39,332,770,929  1533              25651783
            2011  45,915,191,189  1767              25978049
            2012  51,821,573,338  1964              26381830
            2013  57,690,453,461  2150              26838924
            2014  63,067,077,179  2309              27313507
Name: population, Length: 1334, dtype: int64

In [364]:
country_df['agg_population'] = country_df.groupby(['country','year', 'gdp_for_year','gdp_per_capita'])['population'].transform('sum')

In [365]:
country_df

,country,year,population,gdp_for_year,gdp_per_capita,agg_population
132,Albania,2000,232000,"3,632,043,908",1299,2796300
133,Albania,2000,177400,"3,632,043,908",1299,2796300
134,Albania,2000,37800,"3,632,043,908",1299,2796300
135,Albania,2000,24900,"3,632,043,908",1299,2796300
136,Albania,2000,263900,"3,632,043,908",1299,2796300
...,...,...,...,...,...,...
27815,Uzbekistan,2014,3620833,"63,067,077,179",2309,27313507
27816,Uzbekistan,2014,348465,"63,067,077,179",2309,27313507
27817,Uzbekistan,2014,2762158,"63,067,077,179",2309,27313507
27818,Uzbekistan,2014,2631600,"63,067,077,179",2309,27313507
27819,Uzbekistan,2014,1438935,"63,067,077,179",2309,27313507

In [366]:
country_df.drop(columns='population', inplace=True)
country_df

          country  year    gdp_for_year  gdp_per_capita  agg_population
132       Albania  2000   3,632,043,908            1299         2796300
133       Albania  2000   3,632,043,908            1299         2796300
134       Albania  2000   3,632,043,908            1299         2796300
135       Albania  2000   3,632,043,908            1299         2796300
136       Albania  2000   3,632,043,908            1299         2796300
...           ...   ...             ...             ...             ...
27815  Uzbekistan  2014  63,067,077,179            2309        27313507
27816  Uzbekistan  2014  63,067,077,179            2309        27313507
27817  Uzbekistan  2014  63,067,077,179            2309        27313507
27818  Uzbekistan  2014  63,067,077,179            2309        27313507
27819  Uzbekistan  2014  63,067,077,179            2309        27313507

[16008 rows x 5 columns]

In [367]:
country_final_df = country_df.drop_duplicates(keep='first')
country_final_df.reset_index(inplace=True)
country_final_df

      index     country  year    gdp_for_year  gdp_per_capita  agg_population
0       132     Albania  2000   3,632,043,908            1299         2796300
1       144     Albania  2001   4,060,758,804            1451         2799349
2       156     Albania  2002   4,435,078,648            1573         2818839
3       168     Albania  2003   5,746,945,913            2021         2843929
4       180     Albania  2004   7,314,865,176            2544         2874991
...     ...         ...   ...             ...             ...             ...
1329  27760  Uzbekistan  2010  39,332,770,929            1533        25651783
1330  27772  Uzbekistan  2011  45,915,191,189            1767        25978049
1331  27784  Uzbekistan  2012  51,821,573,338            1964        26381830
1332  27796  Uzbekistan  2013  57,690,453,461            2150        26838924
1333  27808  Uzbekistan  2014  63,067,077,179            2309        27313507

[1334 rows x 6 columns]

In [368]:
country_final_df.to_csv('country_table.csv', index=False)

In [369]:
suicide_df.dtypes

country               object
year                   int64
sex                   object
age                   object
suicides_no            int64
suicides_100k_pop    float64
generation            object
dtype: object

In [370]:
# Additional transformation of suicide data wanting to sum all age suicides by country and year
suicide_by_country_df = suicide_df.copy()
suicide_by_country_df['total_suicide'] = suicide_by_country_df.groupby(['country','year'])['suicides_no'].transform('sum')
suicide_by_country_df.drop(columns='suicides_100k_pop', inplace=True)
suicide_by_country_df.drop(columns='generation', inplace=True)
suicide_by_country_df.drop(columns='age', inplace=True)
suicide_by_country_df.drop(columns='sex', inplace=True)
suicide_by_country_df.drop(columns='suicides_no', inplace=True)
suicide_by_country_df = suicide_by_country_df.drop_duplicates(keep='first')
suicide_by_country_df

          country  year  total_suicide
132       Albania  2000             54
144       Albania  2001            119
156       Albania  2002            133
168       Albania  2003            124
180       Albania  2004            146
...           ...   ...            ...
27760  Uzbekistan  2010           1464
27772  Uzbekistan  2011           1640
27784  Uzbekistan  2012           1835
27796  Uzbekistan  2013           1950
27808  Uzbekistan  2014           2095

[1334 rows x 3 columns]

In [371]:
suicide_by_country_df.to_csv('suicide_by_country_table.csv', index=False)

In [372]:
# Additional transformation of suicide data wanting to sum all age suicides by country without regard to year
suicide_by_country_no_year_df = suicide_df.copy()
suicide_by_country_no_year_df['total_suicide'] = suicide_by_country_no_year_df.groupby(['country'])['suicides_no'].transform('sum')
suicide_by_country_no_year_df.drop(columns='suicides_100k_pop', inplace=True)
suicide_by_country_no_year_df.drop(columns='generation', inplace=True)
suicide_by_country_no_year_df.drop(columns='age', inplace=True)
suicide_by_country_no_year_df.drop(columns='sex', inplace=True)
suicide_by_country_no_year_df.drop(columns='suicides_no', inplace=True)
suicide_by_country_no_year_df.drop(columns='year', inplace=True)
suicide_by_country_no_year_df = suicide_by_country_no_year_df.drop_duplicates(keep='first')
suicide_by_country_no_year_df

                    country  total_suicide
132                 Albania            956
420     Antigua and Barbuda              9
768               Argentina          48927
1080                Armenia            937
1282                  Aruba             84
...                     ...            ...
26404  United Arab Emirates            622
26656        United Kingdom          68815
27028         United States         575514
27376               Uruguay           8333
27676            Uzbekistan          19680

[97 rows x 2 columns]

In [373]:
suicide_by_country_no_year_df.to_csv('suicide_by_country_no_year_df_table.csv', index=False)

In [374]:
# Additional transformation of suicide data wanting to sum all suicides by age and year
suicide_by_age_by_year_df = suicide_df.copy()
suicide_by_age_by_year_df['total_suicide'] = suicide_by_age_by_year_df.groupby(['age','year'])['suicides_no'].transform('sum')
suicide_by_age_by_year_df.drop(columns='suicides_100k_pop', inplace=True)
suicide_by_age_by_year_df.drop(columns='generation', inplace=True)
suicide_by_age_by_year_df.drop(columns='country', inplace=True)
suicide_by_age_by_year_df.drop(columns='sex', inplace=True)
suicide_by_age_by_year_df.drop(columns='suicides_no', inplace=True)
suicide_by_age_by_year_df = suicide_by_age_by_year_df.drop_duplicates(keep='first')
suicide_by_age_by_year_df

     year          age  total_suicide
132  2000  25-34 years          41605
133  2000  55-74 years          60973
134  2000    75+ years          21633
136  2000  15-24 years          31742
138  2000  35-54 years          97814
..    ...          ...            ...
901  2011  15-24 years          27937
902  2011  25-34 years          37936
903  2011  55-74 years          59178
904  2011  35-54 years          85345
910  2011   5-14 years           1879

[96 rows x 3 columns]

In [375]:
suicide_by_age_by_year_df.to_csv('suicide_by_age_by_year_df_table.csv', index=False)

In [376]:
# Additional transformation of suicide data wanting to sum all suicides by age
suicide_by_age_df = suicide_df.copy()
suicide_by_age_df['total_suicide'] = suicide_by_age_df.groupby(['age'])['suicides_no'].transform('sum')
suicide_by_age_df.drop(columns='suicides_100k_pop', inplace=True)
suicide_by_age_df.drop(columns='generation', inplace=True)
suicide_by_age_df.drop(columns='country', inplace=True)
suicide_by_age_df.drop(columns='sex', inplace=True)
suicide_by_age_df.drop(columns='suicides_no', inplace=True)
suicide_by_age_df.drop(columns='year', inplace=True)
suicide_by_age_df = suicide_by_age_df.drop_duplicates(keep='first')
suicide_by_age_df

             age  total_suicide
132  25-34 years         607883
133  55-74 years         932350
134    75+ years         371493
136  15-24 years         444777
138  35-54 years        1408892
141   5-14 years          29371

In [377]:
suicide_by_age_df.to_csv('suicide_by_age_df_table.csv', index=False)

In [378]:
engine = create_engine('sqlite:///suicide_life_expectancy.db')

In [414]:
Base.metadata.drop_all(engine)

In [415]:
engine.table_names()

[]

In [416]:
from sqlalchemy import Column, Integer, String, Float
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

In [417]:
# define suicide_clean table
class suicide_clean(Base):
    __tablename__ = 'suicide_clean'
    country = Column(String, primary_key=True)
    year = Column(Float, primary_key=True)
    sex = Column(String, primary_key=True)
    age = Column(String, primary_key=True)
    suicides_no = Column(Float) 
    population = Column(Float) 
    suicides_100k_pop = Column(Float) 
    gdp_for_year = Column(Float) 
    gdp_per_capita = Column(Float) 
    generation = Column(String)

In [418]:
Base.metadata.create_all(engine)

In [419]:
# define suicide_table
class suicide_table(Base):
    __tablename__ ='suicide_table'
    country = Column(String, primary_key=True)
    year = Column(Float, primary_key=True) 
    sex = Column(String, primary_key=True)
    age = Column(String, primary_key=True) 
    suicides_no = Column(Float)
    suicides_100k_pop = Column(Float) 
    generation = Column(String)

In [420]:
Base.metadata.create_all(engine)

In [421]:
# define country_table
class country_table(Base):
    __tablename__ = 'country_table'
    index = Column(Float, primary_key=True) 
    country = Column(String) 
    year = Column(Float) 
    gdp_for_year = Column(Float) 
    gdp_per_capita = Column(Float) 
    agg_population = Column(Float)

In [422]:
Base.metadata.create_all(engine)

In [423]:
# define suicide_by_country_table
class suicide_by_country_table(Base):
    __tablename__ = 'suicide_by_country_table'
    country = Column(String, primary_key=True)
    year = Column(Float, primary_key=True) 
    total_suicide = Column(Float)

In [424]:
Base.metadata.create_all(engine)

In [425]:
# define suicide_by_age_by_year_df_table
class suicide_by_age_by_year_df_table(Base):
    __tablename__ = 'suicide_by_age_by_year_df_table'
    year = Column(Float, primary_key=True)
    age = Column(String, primary_key=True) 
    total_suicide = Column(Float)

In [426]:
Base.metadata.create_all(engine)

In [427]:
# define suicide_by_age_df_table
class suicide_by_age_df_table(Base):
    __tablename__ = 'suicide_by_age_df_table'
    age = Column(String, primary_key=True)
    total_suicide = Column(Float)

In [428]:
Base.metadata.create_all(engine)

In [429]:
# define suicide_by_country_no_year_df_table
class suicide_by_country_no_year_df_table(Base):
    __tablename__ = 'suicide_by_country_no_year_df_table'
    country = Column(String, primary_key=True)
    total_suicide = Column(Float)

In [430]:
Base.metadata.create_all(engine)

In [431]:
engine.table_names()

['country_table',
 'suicide_by_age_by_year_df_table',
 'suicide_by_age_df_table',
 'suicide_by_country_no_year_df_table',
 'suicide_by_country_table',
 'suicide_clean',
 'suicide_table']

In [432]:
df.to_sql(name='suicide_clean', con=engine, if_exists='append', index=False)

In [433]:
suicide_df.to_sql(name='suicide_table', con=engine, if_exists='append', index=False)

In [434]:
country_final_df.to_sql(name='country_table', con=engine, if_exists='append', index=False)

In [435]:
suicide_by_country_df.to_sql(name='suicide_by_country_table', con=engine, if_exists='append', index=False)

In [436]:

suicide_by_country_no_year_df.to_sql(name='suicide_by_country_no_year_df_table', con=engine, if_exists='append', index=False)

In [437]:
suicide_by_age_df.to_sql(name='suicide_by_age_df_table', con=engine, if_exists='append', index=False)

In [438]:
suicide_by_age_by_year_df.to_sql(name='suicide_by_age_by_year_df_table', con=engine, if_exists='append', index=False)

In [439]:
from sqlalchemy.orm import Session
session = Session(engine)

In [444]:
session.query(suicide_clean.country).first()

('Albania')

In [445]:
session.query(suicide_table.country).first()

('Albania')

In [446]:
session.query(country_table.index).first()

(132.0)

In [447]:
session.query(suicide_by_country_table.country).first()

('Albania')

In [448]:
session.query(suicide_by_age_by_year_df_table.year).first()

(2000.0)

In [449]:
session.query(suicide_by_age_df_table.age).first()

('15-24 years')

In [450]:
session.query(suicide_by_country_no_year_df_table.country).first()

('Albania')